In [1]:
# importing required
import mysql.connector
from mysql.connector import Error
import pandas as pd

In [2]:
def create_server_connection(host_name, user_name, user_password):
    connection = None
    try:
        connection = mysql.connector.connect(
            host=host_name, user=user_name, password=user_password
        )
        print("database connection has been done")
    except Error as er:
        print(f"Error : '{er}'")
    return connection
pw="Mysql@bnt12"
db="Group_activity01"
connection = create_server_connection("localhost","root",pw)

database connection has been done

In [3]:
#creating database

def create_database (connection,query):
    cursor=connection.cursor()
    try:
        cursor.execute(query)
        print("Database created")
    except Error as er:
        print(f"Error :'{er}'")
database_create_query="CREATE DATABASE Group_activity01"
create_database(connection,database_create_query)

Error :'1007 (HY000): Can't create database 'group_activity01'; database exists'

In [4]:
#connect to database

def create_db_conncetion(host_name,user_name,user_password,db_name):
    connection=None
    try:
        connection=mysql.connector.connect(host=host_name,user=user_name, password=user_password,database=db_name)
        print("database connetion done")
    except Error as er:
        print(f"Error : '{er}'")
    return connection

In [5]:
#execute sql qurey

def excecute_query(connection,query):
    cursor=connection.cursor()
    try:
        cursor.execute(query)
        connection.commit()
        print("Query was succesful")
    except Error as er:
        print(f"Error :'{er}'")

In [12]:
create_table_query="""create table Student(
                    id int,
                    Name varchar(20),
                    Marks int,
                    Result varchar(20));"""
connection=create_db_conncetion("localhost","root",pw,db)
excecute_query(connection,create_table_query)

database connetion done
Query was succesful

In [13]:
insert_query="""insert into student values(1,"jogesh",89,"Pass"),
                                          (2,"ram",75,"Pass"),
                                          (3,"gopal",33,"Fail"),
                                          (4,"Aman",32,"Fail"),
                                          (5,"Tushar",91,"Pass"),
                                          (6,"Abhisek",52,"Fail"),
                                          (7,"Rohit",78,"Pass")"""
connection=create_db_conncetion("localhost","root",pw,db)
excecute_query(connection,insert_query)

database connetion done
Query was succesful

In [13]:
#for viewing data
def For_select_qureies(connection,query):
    cursor=connection.cursor()
    result=None
    try:
        cursor.execute(query)
        result = cursor.fetchall()
        return result
    except Error as er:
        print(f"Error :'{er}'")

In [14]:
select_all="select * from student"
connection=create_db_conncetion("localhost","root",pw,db)
result=For_select_qureies(connection,select_all)
for x in result:
    print(x)

database connetion done
(1, 'jogesh', 89, 'Pass')
(2, 'ram', 75, 'Pass')
(3, 'gopal', 33, 'Fail')
(4, 'Aman', 32, 'Fail')
(5, 'Tushar', 91, 'Pass')
(6, 'Abhisek', 52, 'Fail')
(7, 'Rohit', 78, 'Pass')
(8, 'pavankumar', 23, 'Fail')
(9, 'subham', 95, 'Pass')
(10, 'Elsa', 99, 'Pass')
(11, 'Prativa', 97, 'Pass')
(12, 'Sriram', 14, 'Fail')
(13, 'Ritvik', 74, 'Pass')
(14, 'Omm', 93, 'Pass')

In [15]:
db_to_df=[]

for x in result:
    x=list(x)
    db_to_df.append(x)
col=["id","Name","Marks","Result"]
df=pd.DataFrame(db_to_df,columns=col)

display(df)

    id        Name  Marks Result
0    1      jogesh     89   Pass
1    2         ram     75   Pass
2    3       gopal     33   Fail
3    4        Aman     32   Fail
4    5      Tushar     91   Pass
5    6     Abhisek     52   Fail
6    7       Rohit     78   Pass
7    8  pavankumar     23   Fail
8    9      subham     95   Pass
9   10        Elsa     99   Pass
10  11     Prativa     97   Pass
11  12      Sriram     14   Fail
12  13      Ritvik     74   Pass
13  14         Omm     93   Pass

In [11]:
df.to_excel("C:\\Users\\JOGESH\\Desktop\\SQL Traning\\Group_activity_01\\Report.xlsx" ,index=False)

In [12]:
insert_query="""insert into student values(14,"Omm",93,"Pass")"""
connection=create_db_conncetion("localhost","root",pw,db)
excecute_query(connection,insert_query)

database connetion done
Query was succesful

In [24]:
update_query="""update student set name="pavankumar" where id=8"""
connection=create_db_conncetion("localhost","root",pw,db)
excecute_query(connection,update_query)

database connetion done
Query was succesful

In [14]:
insert_query="""insert into student values(14,"Ritvik",74,"Pass")"""
connection=create_db_conncetion("localhost","root",pw,db)
excecute_query(connection,insert_query)

database connetion done
Query was succesful

In [24]:
res=()
def column_name():
    
    cursor=connection.cursor()
    res=cursor.description
    print(res)
print(res)

()

In [27]:
delete_query= "delete from student where id=14"
connection=create_db_conncetion("localhost","root",pw,db)
excecute_query(connection,delete_query)

database connetion done
Query was succesful